cf/InformationRegisters/ReportsSnapshots.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ReportsSnapshots</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ReportResult</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UpdateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastViewedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>UserSetting</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportUpdateError</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Variant</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ReportsOptions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UserSettingsHash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ReportsSnapshots/Forms/RecordForm/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers
 
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	RecordStructure = Undefined;
	If Parameters.RecordStructure = Undefined Then
		Common.MessageToUser(NStr(
			"ru = 'Просмотр снимка отчета доступен только из списка снимков отчетов пользователя.';
			|en = 'You can view a report snapshot only from the list of user report snapshots.';"), , , , Cancel);
		Return;
	EndIf;

	FillPropertyValues(ThisObject, RecordStructure);

	SetPrivilegedMode(True);

	Record = InformationRegisters.ReportsSnapshots.CreateRecordManager();
	FillPropertyValues(Record, Parameters.RecordStructure);
	Record.Read();
	If Not Record.Selected() Then
		Common.MessageToUser(NStr("ru = 'Не найдена запись по указанным параметрам.';
													|en = 'No record is found by the specified parameters.';"), , , , Cancel);
	ElsIf Record.ReportUpdateError Then
		Common.MessageToUser(NStr("ru = 'Снимок отчета не был сформирован.';
													|en = 'Report snapshot is not generated.';"), , , , Cancel);
	EndIf;
	If Cancel Then
		Return;
	EndIf;

	ReportResult = Record.ReportResult.Get();
	If TypeOf(ReportResult) = Type("SpreadsheetDocument") Then
		TabDocument.Put(ReportResult);
	Else
		Common.MessageToUser(NStr(
			"ru = 'Ошибка при чтении снимка отчета - некорректные данные.';
			|en = 'An error occurred when reading the report snapshot: the data is incorrect.';"), , , , Cancel);
	EndIf;

	If Not Cancel Then
		Record.LastViewedDate = CurrentSessionDate();
		Record.Write();
	EndIf;

	SetPrivilegedMode(False);

EndProcedure

#EndRegion
